RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_exmc.h
/* EXMC_NINTEN */
#define EXMC_NINTEN_INTRS                   BIT(0)                        /*!< rising edge interrupt status bit */
#define EXMC_NINTEN_INTHS                   BIT(1)                        /*!< high-level interrupt status bit */
#define EXMC_NINTEN_INTFS                   BIT(2)                        /*!< falling edge interrupt status bit */
#define EXMC_NINTEN_INTREN                  BIT(3)                        /*!< rising edge detection interrupt enable bit */
#define EXMC_NINTEN_INTHEN                  BIT(4)                        /*!< high-level detection interrupt enable bit */
#define EXMC_NINTEN_INTFEN                  BIT(5)                        /*!< falling edge detection interrupt enable bit */
#define EXMC_NINTEN_FFEPT                   BIT(6)                        /*!< FIFO empty flag */

/* EXMC_NCTCFG */
#define EXMC_NCTCFG_COMSET                  BITS(0,7)                     /*!< common memory setup time */
#define EXMC_NCTCFG_COMWAIT                 BITS(8,15)                    /*!< common memory wait time */
#define EXMC_NCTCFG_COMHLD                  BITS(16,23)                   /*!< common memory hold time */
#define EXMC_NCTCFG_COMHIZ                  BITS(24,31)                   /*!< common memory data bus HiZ time */

/* EXMC_NATCFG */
#define EXMC_NATCFG_ATTSET                  BITS(0,7)                     /*!< attribute memory setup time */
#define EXMC_NATCFG_ATTWAIT                 BITS(8,15)                    /*!< attribute memory wait time */
#define EXMC_NATCFG_ATTHLD                  BITS(16,23)                   /*!< attribute memory hold time */
#define EXMC_NATCFG_ATTHIZ                  BITS(24,31)                   /*!< attribute memory data bus HiZ time */

/* EXMC_NECC */
#define EXMC_NECC_ECC                       BITS(0,31)                    /*!< ECC result */

/* EXMC_SDCTLx,(x=0,1) */
#define EXMC_SDCTL_CAW                      BITS(0,1)                     /*!< column address bit width */
#define EXMC_SDCTL_RAW                      BITS(2,3)                     /*!< row address bit width */
#define EXMC_SDCTL_SDW                      BITS(4,5)                     /*!< SDRAM data bus width */
#define EXMC_SDCTL_NBK                      BIT(6)                        /*!< number of banks */
#define EXMC_SDCTL_CL                       BIT(7,8)                      /*!< CAS Latency */
#define EXMC_SDCTL_WPEN                     BIT(9)                        /*!< write protection enable */
#define EXMC_SDCTL_SDCLK                    BITS(10,11)                   /*!< SDRAM clock configuration */
#define EXMC_SDCTL_BRSTRD                   BIT(12)                       /*!< burst read enable bit */
#define EXMC_SDCTL_PIPED                    BITS(13,14)                   /*!< pipeline delay */
#define EXMC_SDCTL_SDCLK_2                  BIT(15)                       /*!< bit 2 SDCLK */

/* EXMC_SDTCFGx,(x=0,1) */
#define EXMC_SDTCFG_LMRD                    BITS(0,3)                     /*!< load mode register delay */
#define EXMC_SDTCFG_XSRD                    BITS(4,7)                     /*!< exit self-refresh delay */
#define EXMC_SDTCFG_RASD                    BITS(8,11)                    /*!< row address select delay */
#define EXMC_SDTCFG_ARFD                    BITS(12,15)                   /*!< auto refresh delay */
#define EXMC_SDTCFG_WRD                     BITS(16,19)                   /*!< write recovery delay */
#define EXMC_SDTCFG_RPD                     BITS(20,23)                   /*!< row precharge delay */
#define EXMC_SDTCFG_RCD                     BITS(24,27)                   /*!< row to column delay */

/* EXMC_SDCMD */
#define EXMC_SDCMD_CMD                      BITS(0,2)                     /*!< command */
#define EXMC_SDCMD_DS1                      BIT(3)                        /*!< select device1 */
#define EXMC_SDCMD_DS0                      BIT(4)                        /*!< select device0 */
#define EXMC_SDCMD_NARF                     BITS(5,8)                     /*!< number of successive auto-refresh */
#define EXMC_SDCMD_MRC                      BITS(9,21)                    /*!< mode register content */

/* EXMC_SDARI */
#define EXMC_SDARI_REC                      BIT(0)                        /*!< refresh error flag clear */
#define EXMC_SDARI_ARINTV                   BITS(1,13)                    /*!< auto-refresh interval */
#define EXMC_SDARI_REIE                     BIT(14)                       /*!< refresh error interrupt enable bit */

/* EXMC_SDSTAT */
#define EXMC_SDSDAT_REIF                    BIT(0)                        /*!< refresh error interrupt flag */
#define EXMC_SDSDAT_STA0                    BITS(1,2)                     /*!< device0 status */
#define EXMC_SDSDAT_STA1                    BITS(3,4)                     /*!< device1 status */
#define EXMC_SDSDAT_NRDY                    BIT(5)                        /*!< not ready status */

/* EXMC_SDRSCTL */
#define EXMC_SDRSCTL_RSEN                   BIT(0)                        /*!< read sample enable bit */
#define EXMC_SDRSCTL_SSCR                   BIT(1)                        /*!< select sample cycle of read data */
#define EXMC_SDRSCTL_SDSC                   BITS(4,7)                     /*!< select the delayed sample clock of read data */

/* constants definitions */
/* EXMC NOR/SRAM timing initialize structure */
typedef struct {
    uint32_t asyn_access_mode;                                            /*!< asynchronous access mode */
    uint32_t syn_data_latency;                                            /*!< configure the data latency */
    uint32_t syn_clk_division;                                            /*!< configure the clock divide ratio */
    uint32_t bus_latency;                                                 /*!< configure the bus latency */
    uint32_t asyn_data_holdtime;                                          /*!< configure the data hold time, asynchronous access mode valid */
    uint32_t asyn_data_setuptime;                                         /*!< configure the data setup time, asynchronous access mode valid */
    uint32_t asyn_address_holdtime;                                       /*!< configure the address hold time, asynchronous access mode valid */
    uint32_t asyn_address_setuptime;                                      /*!< configure the address setup time, asynchronous access mode valid */
} exmc_norsram_timing_parameter_struct;

/* EXMC NOR/SRAM initialize structure */
typedef struct {
    uint32_t norsram_region;                                              /*!< select the region of EXMC NOR/PSRAM region */
    uint32_t address_data_mux;                                            /*!< specify whether the data bus and address bus are multiplexed */
    uint32_t memory_type;                                                 /*!< specify the type of external memory */
    uint32_t databus_width;                                               /*!< specify the databus width of external memory */
    uint32_t burst_mode;                                                  /*!< enable or disable the burst mode */
    uint32_t nwait_polarity;                                              /*!< specify the polarity of NWAIT signal from memory */
    uint32_t nwait_config;                                                /*!< NWAIT signal configuration */
    uint32_t memory_write;                                                /*!< enable or disable the write operation */
    uint32_t nwait_signal;                                                /*!< enable or disable the NWAIT signal while in synchronous bust mode */
    uint32_t extended_mode;                                               /*!< enable or disable the extended mode */
    uint32_t asyn_wait;                                                   /*!< enable or disable the asynchronous wait function */
    uint32_t cram_page_size;                                              /*!< specify CRAM page size */
    uint32_t write_mode;                                                  /*!< the write mode, synchronous mode or asynchronous mode */
    exmc_norsram_timing_parameter_struct
    *read_write_timing;              /*!< timing parameters for read and write if the extendedmode is not used or the timing
                                                                               parameters for read if the extendedmode is used */
    exmc_norsram_timing_parameter_struct *write_timing;                   /*!< timing parameters for write when the extendedmode is used */
} exmc_norsram_parameter_struct;

/* EXMC NAND timing initialize struct */
typedef struct {
    uint32_t databus_hiztime;                                             /*!< configure the databus HiZ time for write operation */
    uint32_t holdtime;                                                    /*!< configure the address hold time(or the data hold time for write operation) */
    uint32_t waittime;                                                    /*!< configure the minimum wait time */
    uint32_t setuptime;                                                   /*!< configure the address setup time */
} exmc_nand_timing_parameter_struct;

