RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_exmc.h
/* EXMC NAND initialize struct */
typedef struct {
    uint32_t nand_nwait_gpio;                                             /*!< select the nwait gpio of NAND */
    uint32_t ecc_size;                                                    /*!< the page size for the ECC calculation */
    uint32_t atr_latency;                                                 /*!< configure the latency of ALE low to RB low */
    uint32_t ctr_latency;                                                 /*!< configure the latency of CLE low to RB low */
    uint32_t ecc_logic;                                                   /*!< enable or disable the ECC calculation logic */
    uint32_t databus_width;                                               /*!< the NAND flash databus width */
    uint32_t wait_feature;                                                /*!< enable or disable the wait feature */
    exmc_nand_timing_parameter_struct *common_space_timing;               /*!< the timing parameters for NAND flash common space */
    exmc_nand_timing_parameter_struct *attribute_space_timing;            /*!< the timing parameters for NAND flash attribute space */
} exmc_nand_parameter_struct;

/* EXMC SDRAM timing initialize structure */
typedef struct {
    uint32_t row_to_column_delay;                                         /*!< configure the row to column delay */
    uint32_t row_precharge_delay;                                         /*!< configure the row precharge delay */
    uint32_t write_recovery_delay;                                        /*!< configure the write recovery delay */
    uint32_t auto_refresh_delay;                                          /*!< configure the auto refresh delay */
    uint32_t row_address_select_delay;                                    /*!< configure the row address select delay */
    uint32_t exit_selfrefresh_delay;                                      /*!< configure the exit self-refresh delay */
    uint32_t load_mode_register_delay;                                    /*!< configure the load mode register delay */
} exmc_sdram_timing_parameter_struct;

/* EXMC SDRAM initialize structure */
typedef struct {
    uint32_t sdram_device;                                                /*!< device of SDRAM */
    uint32_t pipeline_read_delay;                                         /*!< the delay for reading data after CAS latency in CK_EXMC clock cycles */
    uint32_t burst_read_switch;                                           /*!< enable or disable the burst read */
    uint32_t sdclock_config;                                              /*!< the SDCLK memory clock for both SDRAM devices */
    uint32_t write_protection;                                            /*!< enable or disable SDRAM device write protection function */
    uint32_t cas_latency;                                                 /*!< configure the SDRAM CAS latency */
    uint32_t internal_bank_number;                                        /*!< the number of internal bank */
    uint32_t data_width;                                                  /*!< the databus width of SDRAM memory */
    uint32_t row_address_width;                                           /*!< the bit width of a row address */
    uint32_t column_address_width;                                        /*!< the bit width of a column address */
    exmc_sdram_timing_parameter_struct *timing;                           /*!< the timing parameters for write and read SDRAM */
} exmc_sdram_parameter_struct;

/* EXMC SDRAM command initialize structure */
typedef struct {
    uint32_t mode_register_content;                                       /*!< the SDRAM mode register content */
    uint32_t auto_refresh_number;                                         /*!< the number of successive auto-refresh cycles will be send when CMD = 011 */
    uint32_t bank_select;                                                 /*!< the bank which command will be sent to */
    uint32_t command;                                                     /*!< the commands that will be sent to SDRAM */
} exmc_sdram_command_parameter_struct;

/* EXMC_register address */
#define EXMC_SNCTL(region)                  REG32(EXMC + 0x08U*((uint32_t)(region)))                      /*!< EXMC SRAM/NOR flash control registers, region = 0,1,2,3 */
#define EXMC_SNTCFG(region)                 REG32(EXMC + 0x04U + 0x08U*((uint32_t)(region)))              /*!< EXMC SRAM/NOR flash timing configuration registers, region = 0,1,2,3 */
#define EXMC_SNWTCFG(region)                REG32(EXMC + 0x104U + 0x08U*((uint32_t)(region)))             /*!< EXMC SRAM/NOR flash write timing configuration registers, region = 0,1,2,3 */

#define EXMC_SDCTL(device)                  REG32(EXMC + 0x140U + 0x4U*(((uint32_t)(device)) - 0x4U))     /*!< EXMC SDRAM control registers,device = 0,1 */
#define EXMC_SDTCFG(device)                 REG32(EXMC + 0x148U + 0x4U*(((uint32_t)(device)) - 0x4U))     /*!< EXMC SDRAM timing configuration registers,device = 0,1 */

/* bank remap */
#define SNCTL_BKREMAP(regval)               (BITS(24,25) & ((uint32_t)(regval) << 24))
#define EXMC_BANK_REMAP_DEFAULT             SNCTL_BKREMAP(0)                                              /*!< default mapping */
#define EXMC_BANK_NORPSRAM_SDRAM_SWAP       SNCTL_BKREMAP(1)                                              /*!< swap NOR/PSRAM bank and SDRAM device 0 address mapping */

/* CRAM page size */
#define SNCTL_CPS(regval)                   (BITS(16,18) & ((uint32_t)(regval) << 16))
#define EXMC_CRAM_AUTO_SPLIT                SNCTL_CPS(0)                                                  /*!< automatic burst split on page boundary crossing */
#define EXMC_CRAM_PAGE_SIZE_128_BYTES       SNCTL_CPS(1)                                                  /*!< page size is 128 bytes */
#define EXMC_CRAM_PAGE_SIZE_256_BYTES       SNCTL_CPS(2)                                                  /*!< page size is 256 bytes */
#define EXMC_CRAM_PAGE_SIZE_512_BYTES       SNCTL_CPS(3)                                                  /*!< page size is 512 bytes */
#define EXMC_CRAM_PAGE_SIZE_1024_BYTES      SNCTL_CPS(4)                                                  /*!< page size is 1024 bytes */

/* NOR region memory data bus width */
#define SNCTL_NRW(regval)                   (BITS(4,5) & ((uint32_t)(regval) << 4))
#define EXMC_NOR_DATABUS_WIDTH_8B           SNCTL_NRW(0)                                                  /*!< NOR data width is 8 bits */
#define EXMC_NOR_DATABUS_WIDTH_16B          SNCTL_NRW(1)                                                  /*!< NOR data width is 16 bits */
#define EXMC_NOR_DATABUS_WIDTH_32B          SNCTL_NRW(2)                                                  /*!< NOR data width is 32 bits */

/* NOR region memory type */
#define SNCTL_NRTP(regval)                  (BITS(2,3) & ((uint32_t)(regval) << 2))
#define EXMC_MEMORY_TYPE_SRAM               SNCTL_NRTP(0)                                                 /*!< SRAM,ROM */
#define EXMC_MEMORY_TYPE_PSRAM              SNCTL_NRTP(1)                                                 /*!< PSRAM,CRAM */
#define EXMC_MEMORY_TYPE_NOR                SNCTL_NRTP(2)                                                 /*!< NOR flash */

